from typing import Any, Dict, List

import pytest


@pytest.fixture
def trans_list() -> List[Dict[str, Any]]:
    return [
        {
            "Дата операции": "20.07.2019 15:27:06",
            "Дата платежа": "23.07.2019",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Категория": "Супермаркет",
            "Сумма операции": -5000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -5000.0,
            "Валюта платежа": "RUB",
            "Описание": "Снятие в банкомате Сбербанк",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 5000.0,
        },
        {
            "Дата операции": "12.12.2021",
            "Дата платежа": "12.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Категория": "Аптеки",
            "Сумма операции": -6486.5,
            "Валюта операции": "RUB",
            "Сумма платежа": -149.0,
            "Валюта платежа": "RUB",
            "Описание": "Circle K",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 149.0,
        },
        {
            "Дата операции": "01.07.2019 17:44:36",
            "Дата платежа": "01.07.2019",
            "Номер карты": "*6002",
            "Статус": "FAILED",
            "Категория": "Супермаркет",
            "Сумма операции": -17000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -17000.0,
            "Валюта платежа": "RUB",
            "Описание": "Перевод с карты",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 17000.0,
        },
    ]


@pytest.fixture
def date_time()-> str:
    return "2021-12-12 03:03:03"
