import pytest
import re
from src.services import search_trans

transactions =  [{
        "Дата операции": "06.06.2018 11:05:01",
        "Дата платежа": "06.06.2018",
        "Статус": "OK",
        "Сумма операции": -10000.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -10000.0,
        "Валюта платежа": "RUB",
        "Категория": "Переводы",
        "Описание": "Иван Ф.",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 10000.0
    },
    {
        "Дата операции": "03.06.2018 14:19:08",
        "Дата платежа": "03.06.2018",
        "Статус": "OK",
        "Сумма операции": -22000.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -22000.0,
        "Валюта платежа": "RUB",
        "Категория": "Переводы",
        "Описание": "Константин Ф.",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 22000.0
    },
     {
        "Дата операции": "20.07.2018 16:29:04",
        "Дата платежа": "20.07.2018",
        "Статус": "OK",
        "Сумма операции": 10000.0,
        "Валюта операции": "RUB",
        "Сумма платежа": 10000.0,
        "Валюта платежа": "RUB",
        "Категория": "Переводы",
        "Описание": "На кудыкину гору",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 3000.0
    }]

expected_data = [{
        "Дата операции": "06.06.2018 11:05:01",
        "Дата платежа": "06.06.2018",
        "Статус": "OK",
        "Сумма операции": -10000.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -10000.0,
        "Валюта платежа": "RUB",
        "Категория": "Переводы",
        "Описание": "Иван Ф.",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 10000.0
    },
    {
        "Дата операции": "03.06.2018 14:19:08",
        "Дата платежа": "03.06.2018",
        "Статус": "OK",
        "Сумма операции": -22000.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -22000.0,
        "Валюта платежа": "RUB",
        "Категория": "Переводы",
        "Описание": "Константин Ф.",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 22000.0
    }]

@pytest.mark.parametrize('input_data, expected', [(transactions, expected_data)])
def test_search_trans(input_data, expected):
    """ Тестирование поиска транзакции перевода физическим лицам """
    result = search_trans(transactions)
    assert result == expected



